# ON34 Python S08 Banco de dados II - Exercicio de casa

Esse documento tem como objetivo descrecer exercícios de uso de consultas de banco de dados.
Para tanto, será usada a Biblioteca SQLite para criarmos e manipularmos tabelas, suas relações e seus dados.

Neste [link](https://colab.research.google.com/drive/1iXh_l1R66L1B30lIj-oLATCwCLyWdF0u?usp=sharing) é possivel encontrar uma explicação completa de como a biblioteca funciona e suas principais features.

Para documentações oficiais use esse link da [biblioteca Python do SQLite](https://docs.python.org/3/library/sqlite3.html) e esse das [funções SQLite](https://www.sqlitetutorial.net/).

Sendo assim, a seguir vou passar mais para um caso de uso dessa aula, criar uma visão prática de uso de banco de dados.

# Visualizando o banco

Nesse ponto, o objetivo principal é o entendimento do Banco de dados usado para os exercicos dessa aula.

Sendo assim, o caso que servirá de plano de fundo para esse exercicio é o da Companhia Aerea SAMBA em um arquivo chamado "dados_de_voo.db", que possui as seguintes tabelas já populadas:

![Banco de dados](https://drive.google.com/uc?export=view&id=1JUVNzdDnOEpS9UracGfdZcQKBllAANfS)

##Inserindo dados e populando

In [ ]:
# Importar a biblioteca
import sqlite3

#Criar uma conexão com um banco de dados (no nosso caso, não temos um arquivo de banco de dados pré feito, então decidiu-se inicializar um denominado dados_de_voo.db)
conn = sqlite3.connect("dados_de_voo.db")

# Criar um cursor no banco que permitirá o uso de comandos no formato SQL
cur  = conn.cursor()

In [ ]:
# Criando a tabela registro_passageiros
cur.execute("""
CREATE TABLE registro_passageiros (
  id_passageiro TEXT NOT NULL PRIMARY KEY,
  st_nome TEXT NOT NULL,
  st_categoria TEXT NOT NULL,
  st_sexo TEXT,
  dt_nascimento TEXT NOT NULL,
  st_nacionalidade TEXT NOT NULL,
  st_estado_civil TEXT NOT NULL
)
""")

# Criando a tabela restricao_alimentar
cur.execute("""
CREATE TABLE restricao_alimentar (
  id_passageiro TEXT NOT NULL,
  st_alergia_alimentar TEXT,
  st_restricao_alimentar TEXT,
  FOREIGN KEY (id_passageiro)
      REFERENCES registro_passageiros (id_passageiro)
         ON DELETE CASCADE
         ON UPDATE NO ACTION
)
""")

# Criando a tabela registro_refeicoes
cur.execute("""
CREATE TABLE registro_refeicoes(
  id_refeicao TEXT NOT NULL PRIMARY KEY,
  st_nome TEXT NOT NULL,
  float_custo REAL NOT NULL
)
""")

# Criando a tabela registro_alergicos
cur.execute("""
CREATE TABLE registro_alergicos(
  id_refeicao TEXT NOT NULL,
  st_alergico TEXT NOT NULL,
  FOREIGN KEY (id_refeicao)
      REFERENCES registro_refeicoes (id_refeicao)
         ON DELETE CASCADE
         ON UPDATE NO ACTION
)
""")

# Criando a tabela registro_voo
cur.execute("""
CREATE TABLE registro_voo(
  id_voo TEXT NOT NULL PRIMARY KEY,
  st_origem TEXT NOT NULL,
  st_destino TEXT NOT NULL,
  dt_voo TEXT NOT NULL
)
""")

In [ ]:
# Criando a tabela registro_passageiros (id_passageiro, st_nome, st_categoria, st_sexo, dt_nascimento, st_nacionalidade, st_estado_civil)
cur.execute("""
INSERT INTO registro_passageiros VALUES
  ('p1','Ana Antunes','Gold','F','14/06/1999','Brasileiro', 'solteiro(a)'),
  ('p2','Mario Marques','Silver','M','06/11/1980','Brasileiro', 'solteiro(a)'),
  ('p3','Maria Marques','Silver','F','16/10/1976','Brasileiro', 'divorciado(a)'),
  ('p4','Pietro Palmeira','Silver','M','26/10/1988','Português', 'casado(a)'),
  ('p5','Pamela Pluma Palmeira','Silver','F','26/10/1988','Brasileiro', 'Casado(a)'),
  ('p6','Saulo Sauro','Bronze','M','23/11/1998','Brasileiro', 'solteiro(a)'),
  ('p7','Volverine Valadares','Gold','M','04/04/2006','Brasileiro', 'solteiro(a)'),
  ('p8','Waldisney Washington','Gold','M','02/05/2000','Brasileiro', 'divorciado(a)'),
  ('p9','Daniel Dimes','Silver','M','17/09/1995','Brasileiro', 'solteiro(a)'),
  ('p10','Daniela Dimes','Silver','F','17/09/2023','Brasileiro', 'solteiro(a)')


""")
# Comitar as inserções
conn.commit()

#Verificar dados na tabela
res = cur.execute("SELECT * FROM registro_passageiros")
res.fetchall()

[('p1', 'Ana Antunes', 'Gold', 'F', '14/06/1999', 'Brasileiro', 'solteiro(a)'),
 ('p2',
  'Mario Marques',
  'Silver',
  'M',
  '06/11/1980',
  'Brasileiro',
  'solteiro(a)'),
 ('p3',
  'Maria Marques',
  'Silver',
  'F',
  '16/10/1976',
  'Brasileiro',
  'divorciado(a)'),
 ('p4',
  'Pietro Palmeira',
  'Silver',
  'M',
  '26/10/1988',
  'Português',
  'casado(a)'),
 ('p5',
  'Pamela Pluma Palmeira',
  'Silver',
  'F',
  '26/10/1988',
  'Brasileiro',
  'Casado(a)'),
 ('p6',
  'Saulo Sauro',
  'Bronze',
  'M',
  '23/11/1998',
  'Brasileiro',
  'solteiro(a)'),
 ('p7',
  'Volverine Valadares',
  'Gold',
  'M',
  '04/04/2006',
  'Brasileiro',
  'solteiro(a)'),
 ('p8',
  'Waldisney Washington',
  'Gold',
  'M',
  '02/05/2000',
  'Brasileiro',
  'divorciado(a)'),
 ('p9',
  'Daniel Dimes',
  'Silver',
  'M',
  '17/09/1995',
  'Brasileiro',
  'solteiro(a)'),
 ('p10',
  'Daniela Dimes',
  'Silver',
  'F',
  '17/09/2023',
  'Brasileiro',
  'solteiro(a)')]

In [ ]:
# Criando a tabela restricao_alimentar (id_passageiro, st_alergia_alimentar, st_restricao_alimentar)
cur.execute("""
INSERT INTO restricao_alimentar (id_passageiro, st_alergia_alimentar) VALUES
  ('p2','Lactose'),
  ('p3','Lactose'),
  ('p4','Frutos do Mar'),
  ('p4','Castanhas'),
  ('p7','Glutem'),
  ('p7','Frutos do Mar')
""")

cur.execute("""
INSERT INTO restricao_alimentar (id_passageiro, st_restricao_alimentar) VALUES
  ('p1','Vegano'),
  ('p8','Vegetariano')
""")

cur.execute("""
INSERT INTO restricao_alimentar VALUES
  ('p6','Castanhas','Vegetariano')
""")

# Comitar as inserções
conn.commit()

#Verificar dados na tabela
res = cur.execute("SELECT * FROM restricao_alimentar")
res.fetchall()

[('p2', 'Lactose', None),
 ('p3', 'Lactose', None),
 ('p4', 'Frutos do Mar', None),
 ('p4', 'Castanhas', None),
 ('p7', 'Glutem', None),
 ('p7', 'Frutos do Mar', None),
 ('p1', None, 'Vegano'),
 ('p8', None, 'Vegetariano'),
 ('p6', 'Castanhas', 'Vegetariano')]

In [ ]:
# Criando a tabela registro_refeicoes (id_refeicao, st_nome, float_custo)
cur.execute("""
INSERT INTO registro_refeicoes VALUES
  ('r1', 'Frango com Legumes', 20),
  ('r2', 'Picadinho de carne', 25),
  ('r3', 'Salada com castanhas', 15),
  ('r4', 'Risoto de Camarão', 30),
  ('r5', 'Hamburguer Combo', 35),
  ('r6', 'Hamburguer Vegano Combo', 30)
""")
# Comitar as inserções
conn.commit()

#Verificar dados na tabela
res = cur.execute("SELECT * FROM registro_refeicoes")
res.fetchall()

[('r1', 'Frango com Legumes', 20.0),
 ('r2', 'Picadinho de carne', 25.0),
 ('r3', 'Salada com castanhas', 15.0),
 ('r4', 'Risoto de Camarão', 30.0),
 ('r5', 'Hamburguer Combo', 35.0),
 ('r6', 'Hamburguer Vegano Combo', 30.0)]

In [ ]:
# Criando a tabela registro_alergicos (id_refeicao, st_alergico)
cur.execute("""
INSERT INTO registro_alergicos VALUES
  ('r1', "Vegetariano"),
  ('r1', "Vegano"),
  ('r1', "Glutem"),
  ('r2', "Vegetariano"),
  ('r2', "Vegano"),
  ('r2', "Glutem"),
  ('r3', "Castanhas"),
  ('r4', "Lactose"),
  ('r4', "Frutos do Mar"),
  ('r4', "Vegetariano"),
  ('r4', "Vegano"),
  ('r4', "Glutem"),
  ('r5', "Vegetariano"),
  ('r5', "Vegano"),
  ('r5', "Glutem"),
  ('r5', "Lactose")
""")
# Comitar as inserções
conn.commit()

#Verificar dados na tabela
res = cur.execute("SELECT * FROM registro_alergicos")
res.fetchall()

[('r1', 'Vegetariano'),
 ('r1', 'Vegano'),
 ('r1', 'Glutem'),
 ('r2', 'Vegetariano'),
 ('r2', 'Vegano'),
 ('r2', 'Glutem'),
 ('r3', 'Castanhas'),
 ('r4', 'Lactose'),
 ('r4', 'Frutos do Mar'),
 ('r4', 'Vegetariano'),
 ('r4', 'Vegano'),
 ('r4', 'Glutem'),
 ('r5', 'Vegetariano'),
 ('r5', 'Vegano'),
 ('r5', 'Glutem'),
 ('r5', 'Lactose')]

In [ ]:
# Criando a tabela registro_voo (id_voo,  st_origem, st_destino, dt_voo)
cur.execute("""
INSERT INTO registro_voo VALUES
  ('v1', "GRU", "REC", "01/02/2024"),
  ('v2', "VCP", "SDU", "15/03/2024"),
  ('v3', "REC", "GRU", "20/06/2024")
""")
# Comitar as inserções
conn.commit()

#Verificar dados na tabela
res = cur.execute("SELECT * FROM registro_voo")
res.fetchall()

[('v1', 'GRU', 'REC', '01/02/2024'),
 ('v2', 'VCP', 'SDU', '15/03/2024'),
 ('v3', 'REC', 'GRU', '20/06/2024')]

# Desafios de casa

A seguir, alguns exercicios serão propostos, usem as funções que aprenderam na aula 07 e 08 para resolver:

## Desafio 1

Crie uma nova tabela de itinerários com os três voos existente na tabela registro_voos.

In [ ]:
#A tabela Voo
cur.execute("SELECT * FROM registro_voo").fetchall()

[('v1', 'GRU', 'REC', '01/02/2024'),
 ('v2', 'VCP', 'SDU', '15/03/2024'),
 ('v3', 'REC', 'GRU', '20/06/2024')]

Sendo assim, crie a tabela registro_itinerarios com as seguintes colunas:


*   id_voo (chave estrangeira) TEXT
*   id_passageiro (chave estrangeira) TEXT
*   id_refeicao (chave estrangeira) TEXT


Pontos de atenção:


*   Cada passageiro tem uma restrição alimentar, considere ela ao designar cada refeição a cada passageiro. (Comente como fez isso)





Dica:

Use a inserção de valores a partir de uma consulta para agilizar o trabalho:

INSERT INTO nome_tabela_nova
SELECT colunas
FROM nome_tabela_consultada

(O desafio extra do exercicio de aula possui uma tabela com os menus disponíveis para cada passageiro, podem usá-lo para ajudar a preencher)

## Desafio 2

A precificação da SAMBA é pela categoria do cliente, e segue a seguinte regra:

*   Silver - R$550.6

*   Bronze - R$450.7

*   Gold - R$350.2

Adicione uma nova coluna na tabela registro_voos com o valor de cada passageiro em cada voo. Após isso, determine qual voo foi mais rentável.

Ponto de atenção: Para determinar rentabilidade, devemos tirar os custos do lucro de venda. Considere como custo de cada voo R$300.0 mais os custos de refeição de cada passageiro daquele voo.

Explique passo a passo como chegou nas respostas.